package my_package;

/**
 * Created by lapte on 29.06.2016.
 */
public class CodeRules {
    /*
    1. Осмысленные названия классов, методов, переменных.
    2. Документировать код. Писать комментарии.
    3. Использовать this, super.
    4. Избегать magic numbers. Для чисел вводить обозначения(константы).
    5. Писать тесты на весь код.
    6. Не возвращать в методах null, чтобы избежать NullPointerException.
    7. Число строк в методе должно быть <= 10.
    8. Один return на весь метод.
     */
}
